w8d1/reddit_clone/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def current_user
    @current_user = User.find_by(session_token: session[:session_token])