W6D4/my_routes_project/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2], ["created_at", "2019-11-21 18:40:44.776335"], ["updated_at", "2019-11-21 18:40:44.776335"]]
---
  def create
    artwork_shares = ArtworkShare.new(artwork_shares_params)
    if artwork_shares.save