W6D4/my_routes_project/app/controllers/artworks_controller.rb

  def index
    my_artworks = Artwork.where(artist_id: params[:user_id])
    shared_artworks = User.find(params[:user_id]).shared_artworks
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    artworks = Artwork.new(artwork_params)
    if artworks.save
---
INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello_creation"], ["img_url", "img.com"], ["artist_id", 1], ["created_at", "2019-11-21 18:34:29.309186"], ["updated_at", "2019-11-21 18:34:29.309186"]]