W6D4/my_routes_project/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
---
  def index
    if params[:user_id]
      my_comments = Comment.where(author_id: params[:user_id])
    elsif params[:artwork_id]
      my_comments = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "this is amazing"], ["author_id", 3], ["artwork_id", 1], ["created_at", "2019-11-21 19:42:55.963264"], ["updated_at", "2019-11-21 19:42:55.963264"]]
---
  def create
    comments = Comment.new(comment_params)
    if comments.save