W6D4/my_routes_project/app/controllers/users_controller.rb

  def index
    if params[:query]
      users = User.where(username: params[:query])
    else
      users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Manraj"]]
SELECT "users".* FROM "users"

  def create_like
    like = Like.new(likes_params)
    if like.save
---
INSERT INTO "likes" ("liker_id", "likeable_id", "likeable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["liker_id", 1], ["likeable_id", 2], ["likeable_type", "Artwork"], ["created_at", "2019-11-21 23:55:41.915270"], ["updated_at", "2019-11-21 23:55:41.915270"]]